#include <stdio.h>

main(){

int i; 
int j;
int a[8]={1, 2, 6, 24, 120, 720, 5040, 40320};
int b[8]={1, 2, 3, 4, 5, 6, 7, 8};
int t1; //остаток от деления
int t2; //целая часть от деления
int t3; //вспомогательная, для перестановки двух значений местами

for (i=0; i<40320; i++){
  t1=i;
  printf("%d - ", i);
  for (j=0; j<=6; j++){
    t2=t1/a[6-j]; 
    t1=t1%a[6-j];
    t3=b[j]; b[j]=b[j+t2]; b[j+t2]=t3; //делаем перестановку двух элементов массива.
    printf("%d ", b[j]);
    b[j]=j+1;
    };
  printf("%d\n", b[7]); 
  b[7]=8;
//  sleep(0.5);
  };
}
